app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My Dear Kuttichathan"], ["rating", "PG"], ["director", "T K Rajeev Kumar"], ["created_at", "2019-03-04 11:10:02.406301"], ["updated_at", "2019-03-04 11:10:02.406301"]]

  def search
    @movies_by_same_director = Movie.movies_by_same_director(params[:title])
    if @movies_by_same_director.nil?
      redirect_to root_url, alert: "'#{params[:title]}' does not contain director information"
    end
    @movie = Movie.find_by(title: params[:title])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Aladdin"]]